App/Catalogs/Блюда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Блюда</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Name>Ресторан</Name>
				<Type>
					<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
				</Type>
			</Attribute>
			<Attribute>
				<Name>Категория</Name>
				<Type>
					<v8:Type>cfg:CatalogRef.КатегорииБлюд</v8:Type>
				</Type>
			</Attribute>
			<Attribute>
				<Name>ХранилищеФотографии</Name>
				<Type>
					<v8:Type>v8:ValueStorage</v8:Type>
				</Type>
			</Attribute>
			<Attribute>
				<Name>ЕстьФотография</Name>
				<Type>
					<v8:Type>xs:boolean</v8:Type>
				</Type>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

App/InformationRegisters/ЦеныБлюд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныБлюд</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Name>Блюдо</Name>
				<Type>
					<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
				</Type>
			</Dimension>
			<Resource>
				<Name>Цена</Name>
				<Type>
					<v8:Type>xs:decimal</v8:Type>
					<v8:NumberQualifiers>
						<v8:Digits>15</v8:Digits>
						<v8:FractionDigits>2</v8:FractionDigits>
					</v8:NumberQualifiers>
				</Type>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

App/Catalogs/Блюда/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// Форма элемента справочника Блюда.
// Фотография хранится в ХранилищеФотографии (ХранилищеЗначения с ДвоичныеДанные).
// В форме она отображается через временное хранилище (АдресФотографии).

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОбновитьКартинкуНаСервере();

КонецПроцедуры

&НаСервере
Процедура ОбновитьКартинкуНаСервере()

	АдресФотографии = "";

	Если Объект.ЕстьФотография Тогда
		ДанныеФотографии = Объект.ХранилищеФотографии.Получить();
		Если ТипЗнч(ДанныеФотографии) = Тип("ДвоичныеДанные") Тогда
			АдресФотографии = ПоместитьВоВременноеХранилище(ДанныеФотографии, УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Фотография

&НаКлиенте
Процедура ВыбратьФото(Команда)

	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьФотоЗавершение", ЭтотОбъект);
	НачатьПомещениеФайла(ОписаниеОповещения, , , Истина, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФотоЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт

	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли;

	ИмяФайлаВНижнемРегистре = НРег(ВыбранноеИмяФайла);
	ПодходящееРасширение = Прав(ИмяФайлаВНижнемРегистре, 4) = ".jpg"
		ИЛИ Прав(ИмяФайлаВНижнемРегистре, 5) = ".jpeg"
		ИЛИ Прав(ИмяФайлаВНижнемРегистре, 4) = ".png";

	Если НЕ ПодходящееРасширение Тогда
		Сообщить("Для фотографии блюда допустимы только файлы JPG и PNG.", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;

	ЗаписатьФотографиюНаСервере(Адрес);

КонецПроцедуры

&НаСервере
Процедура ЗаписатьФотографиюНаСервере(АдресВременногоХранилища)

	ДанныеФотографии = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	Объект.ХранилищеФотографии = Новый ХранилищеЗначения(ДанныеФотографии);
	Объект.ЕстьФотография = Истина;
	АдресФотографии = АдресВременногоХранилища;

КонецПроцедуры

&НаКлиенте
Процедура УдалитьФото(Команда)

	УдалитьФотографиюНаСервере();

КонецПроцедуры

&НаСервере
Процедура УдалитьФотографиюНаСервере()

	Объект.ХранилищеФотографии = Новый ХранилищеЗначения(Неопределено);
	Объект.ЕстьФотография = Ложь;
	АдресФотографии = "";

КонецПроцедуры

// Цена

&НаКлиенте
Процедура УстановитьЦену(Команда)

	ПараметрыФормы = ПараметрыФормыУстановкиЦены();
	Если ПараметрыФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОткрытьФорму("РегистрСведений.ЦеныБлюд.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

&НаСервере
Функция ПараметрыФормыУстановкиЦены()

	Если Объект.Ссылка.Пустая() Тогда
		Сообщить("Сначала запишите блюдо, затем установите цену.", СтатусСообщения.Важное);
		Возврат Неопределено;
	КонецЕсли;

	ЗначенияЗаполнения = Новый Структура("Блюдо", Объект.Ссылка);
	Возврат Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);

КонецФункции
